Функция СведенияОВнешнейОбработке() Экспорт
ПарамРег = Новый Структура();
ПарамРег.Вставить("Наименование", "Заполнение оснований в таможенной декларации");
ПарамРег.Вставить("БезопасныйРежим", Истина);
ПарамРег.Вставить("Версия ", "ver.: 1.1");
ПарамРег.Вставить("Информация", "Обработка для подбора реализация для таможенных деклараций");
ПарамРег.Вставить("Вид", "ДополнительнаяОбработка");

ТЗ_Команды = Новый ТаблицаЗначений;
ТЗ_Команды.Колонки.Добавить("Идентификатор");
ТЗ_Команды.Колонки.Добавить("Использование");
ТЗ_Команды.Колонки.Добавить("Представление");

НоваяСтрока = ТЗ_Команды.Добавить();
НоваяСтрока.Идентификатор = "ЗаполнениеОснованийТаможеннойДекларации";
НоваяСтрока.Использование = "ОткрытиеФормы";
НоваяСтрока.Представление = "Заполнение оснований в таможенной декларации";
ПарамРег.Вставить("Команды", ТЗ_Команды);

Возврат ПарамРег;

КонецФункции